cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32_test/main.cpp
void handleSaveMqtt() {
  if (server.hasArg("mqtt_server")) {
    mqtt_server = server.arg("mqtt_server");
    mqtt_port = server.arg("mqtt_port").toInt();
    mqtt_user = server.arg("mqtt_user");
    mqtt_pass = server.arg("mqtt_pass");
    mqtt_client_id = server.arg("mqtt_client_id");

    preferences.begin("gate_config", false);
    preferences.putString("mqtt_server", mqtt_server);
    preferences.putInt("mqtt_port", mqtt_port);
    preferences.putString("mqtt_user", mqtt_user);
    preferences.putString("mqtt_pass", mqtt_pass);
    preferences.putString("mqtt_client_id", mqtt_client_id);
    preferences.end();

    String html = "<html><head><meta name='viewport' content='width=device-width, initial-scale=1'><meta http-equiv='refresh' content='5;url=/'><style>body{background:#121212;color:#fff;text-align:center;padding:50px;font-family:Arial;} .btn-orange{background:#ff9f43;color:#121212;padding:12px 20px;text-decoration:none;border-radius:6px;font-weight:bold;display:inline-block;margin-top:20px;}</style></head><body><h2 style='color:#00adb5;'>Pengaturan MQTT Disimpan!</h2><p>Sistem sedang di-restart (Otomatis kembali dalam 5 detik)...</p><a href='/' class='btn-orange'>KEMBALI KE DASHBOARD</a></body></html>";
    server.send(200, "text/html", html);
    esp_task_wdt_delete(xTaskGetCurrentTaskHandle()); 
    delay(2000);
    ESP.restart();
  }
}

void handleForgetWifi() {
  String html = "<html><head><meta name='viewport' content='width=device-width, initial-scale=1'><style>body{background:#121212;color:#fff;text-align:center;padding:50px;font-family:Arial;}</style></head><body><h2 style='color:#ff5252;'>WiFi Telah Dilupakan!</h2><p>ESP32 akan restart dan masuk ke mode Hotspot Setup (Wanara_Gate_Setup).</p><p>Silakan hubungkan HP Anda ke WiFi tersebut untuk mengatur koneksi baru.</p></body></html>";
  server.send(200, "text/html", html);
  
  Serial.println("[WIFI] Perintah Forget WiFi diterima. Menghapus kredensial...");
  delay(2000);
  wm.resetSettings(); // Menghapus SSID & Password dari memori NVS
  esp_task_wdt_delete(xTaskGetCurrentTaskHandle()); 
  ESP.restart();
}

void handleCekUpdate() {
  String html = "<html><head><meta name='viewport' content='width=device-width, initial-scale=1'><meta http-equiv='refresh' content='2;url=/do_update'><style>body{background:#121212;color:#fff;text-align:center;padding:50px;font-family:Arial;} .loader{border:6px solid #1e1e1e;border-top:6px solid #00adb5;border-radius:50%;width:50px;height:50px;animation:spin 1s linear infinite;margin:20px auto;} @keyframes spin{0%{transform:rotate(0deg);}100%{transform:rotate(360deg);}}</style></head><body><h2 style='color:#00adb5;'>Menghubungi GitHub...</h2><div class='loader'></div><p>Sistem sedang memproses OTA, mohon tunggu sebentar...</p></body></html>";
  server.send(200, "text/html", html);
}

void handleDoUpdate() {
  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "text/html", ""); // Mulai mode chunked live streaming

  String htmlStart = R"rawliteral(
  <!DOCTYPE html>
  <html>
  <head>
    <meta name='viewport' content='width=device-width, initial-scale=1'>
    <style>
      body { background-color: #121212; color: #ffffff; font-family: Arial, sans-serif; text-align: center; padding: 20px; }
      .box { max-width: 500px; margin: 0 auto; padding: 25px; background-color: #1e1e1e; border-radius: 12px; box-shadow: 0 4px 15px rgba(0,0,0,0.5); }
      h2 { color: #00adb5; margin-bottom: 20px; }
      pre { background-color: #000; padding: 15px; border-radius: 8px; text-align: left; overflow-x: auto; color: #00ff00; font-size: 14px; white-space: pre-wrap; word-wrap: break-word; }
      .btn-orange { background-color: #ff9f43; color: #121212; width: 100%; padding: 12px; border-radius: 6px; font-weight: bold; cursor: pointer; border: none; text-decoration: none; display: inline-block; margin-top: 20px; box-sizing: border-box;}
    </style>
  </head>
  <body>
    <div class='box'>
      <h2>Hasil Proses OTA</h2>
      <pre>)rawliteral";

  server.sendContent(htmlStart);
  
  // Eksekusi update dan streaming log ke web perlahan-lahan
  cekUpdateGitHub(true);
  
  // Jika gagal/tidak butuh update, tutup tag HTML-nya
  server.sendContent("</pre><a href='/' class='btn-orange'>KEMBALI KE DASHBOARD</a></div></body></html>");
  server.sendContent(""); // Sinyal selesai HTTP
}

// ========================================================================
// FUNGSI KONTROL GERBANG
// ========================================================================
unsigned long gateOpenTime = 0;
bool isGateOpen = false;

void openGate() {
  isGateOpen = true;
  gateOpenTime = millis();
  digitalWrite(LED_PIN, HIGH); // Nyalakan LED (Atau trigger RELAY untuk buka gerbang)
  Serial.println("[GATE] Gerbang Terbuka (Relay ON)");
}

void handleGate() {
  // Jika gerbang sedang terbuka dan waktunya (3 detik) sudah habis
  if (isGateOpen && (millis() - gateOpenTime > GATE_OPEN_MS)) {
    isGateOpen = false;
    digitalWrite(LED_PIN, LOW); // Matikan LED (Tutup RELAY)
    Serial.println("[GATE] Waktu habis. Gerbang Tertutup (Relay OFF)");
  }
}

// ========================================================================
// CALLBACK MQTT (Saat menerima pesan dari Server)
// ========================================================================
void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String message;
  for (unsigned int i = 0; i < length; i++) {
    message += (char)payload[i];
  }
  Serial.printf("\n[MQTT] Pesan masuk di topik: %s\n", topic);
  Serial.println("[MQTT] Payload: " + message);

  JsonDocument doc; // Menggunakan ArduinoJson v7 (Jika v6, gunakan DynamicJsonDocument doc(512);)
  DeserializationError error = deserializeJson(doc, message);
  if (error) {
    Serial.println("[JSON] Gagal mem-parsing payload dari server.");
    return;
  }

  String topicStr = String(topic);
  String resTopic = "gate/" + mqtt_client_id + "/result";
  String cmdTopic = "gate/" + mqtt_client_id + "/command";

  // Skenario 1: Cek status validitas kartu
  if (topicStr == resTopic) {
    String status = doc["status"];
    if (status == "valid") {
      Serial.println("[AKSES] Diberikan! Pesan: " + doc["message"].as<String>());
      openGate(); // Buka gerbang
    } else if (status == "invalid") {
      Serial.println("[AKSES] Ditolak! Alasan: " + doc["message"].as<String>());
    }
  } 
  // Skenario 2: Command Manual
  else if (topicStr == cmdTopic) {
    String cmd = doc["command"];
    if (cmd == "open_gate") {
      Serial.println("[COMMAND] Perintah Override: Buka Gerbang!");
      openGate();
    } else if (cmd == "reboot") {
      Serial.println("[COMMAND] Perintah Reboot dari server. Restarting...");
      esp_task_wdt_delete(xTaskGetCurrentTaskHandle()); 
      delay(1000);
      ESP.restart();
    }
  }
}

// ========================================================================
// FUNGSI MQTT
// ========================================================================
unsigned long lastMqttReconnectAttempt = 0;

