cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32_test/main.cpp
void reconnectMQTT() {
  Serial.printf("[MQTT] Melakukan TCP Ping ke %s:%d...\n", mqtt_server.c_str(), mqtt_port);
  
  // Cek apakah server dan port 1883 bisa dijangkau
  if (!espClient.connect(mqtt_server.c_str(), mqtt_port)) {
    Serial.println("[MQTT] ERROR: Ping Gagal! Server tidak dapat dijangkau.");
    Serial.println("[MQTT] Saran: Cek IP, apakah EMQX berjalan, atau UFW/Firewall memblokir port 1883.");
    return; // Langsung keluar agar Web Dashboard tetap responsif
  }
  espClient.stop(); // Tutup koneksi TCP sementara karena ping sukses
  Serial.println("[MQTT] Ping Sukses! Server aktif.");

  Serial.print("[MQTT] Melakukan Autentikasi ke EMQX Broker...");
  if (mqttClient.connect(mqtt_client_id.c_str(), mqtt_user.c_str(), mqtt_pass.c_str())) {
    Serial.println(" Terhubung!");
    
    String resTopic = "gate/" + mqtt_client_id + "/result";
    String cmdTopic = "gate/" + mqtt_client_id + "/command";
    
    mqttClient.subscribe(resTopic.c_str());
    mqttClient.subscribe(cmdTopic.c_str());
    
    Serial.println("[MQTT] Berhasil subscribe ke topik result & command.");
  } else {
    Serial.print(" Gagal, rc=");
    Serial.println(mqttClient.state());
  }
}

// ========================================================================
// 4. SETUP & MAIN LOOP
// ========================================================================
void setup() {
  Serial.begin(115200);
  delay(1000);

  // Ambil data folder aktif dan nama AP WiFi dari memori internal
  preferences.begin("gate_config", true);
  folderAktif = preferences.getString("ota_folder", "ESP32main");
  savedApSSID = preferences.getString("ap_ssid", DEFAULT_AP_SSID); // Mengambil dari const di atas

  // Load konfigurasi MQTT (Jika tidak ada, fallback ke nilai variabel global)
  mqtt_server = preferences.getString("mqtt_server", mqtt_server);
  mqtt_port = preferences.getInt("mqtt_port", mqtt_port);
  mqtt_user = preferences.getString("mqtt_user", mqtt_user);
  mqtt_pass = preferences.getString("mqtt_pass", mqtt_pass);
  mqtt_client_id = preferences.getString("mqtt_client_id", mqtt_client_id);
  preferences.end();

  // Memulai WiFi Manager (Jika gagal konek, panggil AP dan Password dari const di atas)
  Serial.println("\n[WIFI] Mencoba terhubung ke jaringan...");
  wm.autoConnect(savedApSSID.c_str(), DEFAULT_AP_PASSWORD);
  Serial.println("[WIFI] Sukses Terhubung! IP Web Dashboard: " + WiFi.localIP().toString());

  // Routing Halaman Web
  server.on("/", handleRoot);
  server.on("/save_folder", HTTP_POST, handleSaveFolder);
  server.on("/save_mqtt", HTTP_POST, handleSaveMqtt);
  server.on("/cek_update", HTTP_GET, handleCekUpdate);
  server.on("/forget_wifi", HTTP_POST, handleForgetWifi);
  server.on("/do_update", HTTP_GET, handleDoUpdate);
  server.begin();

  // Setup SPI & RFID
  SPI.begin(); // Otomatis menggunakan VSPI ESP32 (SCK=18, MISO=19, MOSI=23)
  mfrc522.PCD_Init();
  Serial.println("[RFID] Sensor MFRC522 Siap.");

  // Setup Barcode Scanner (UART2)
  Serial2.begin(BARCODE_BAUD, SERIAL_8N1, BARCODE_RX, BARCODE_TX);
  Serial.println("[BARCODE] Scanner UART2 Siap (GPIO 16/17).");

  // Setup MQTT Broker
  mqttClient.setServer(mqtt_server.c_str(), mqtt_port);
  mqttClient.setCallback(mqttCallback); // Daftarkan fungsi callback
  mqttClient.setBufferSize(512);        // Perbesar buffer agar JSON aman

  // Aktifkan Task Watchdog Timer SETELAH WiFi Terhubung (Mencegah restart saat loading WiFi)
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    esp_task_wdt_config_t twdt_config = {
        .timeout_ms = WDT_TIMEOUT_SECONDS * 1000,
        .idle_core_mask = 0,
        .trigger_panic = true
    };
    esp_task_wdt_reconfigure(&twdt_config);
  #else
    esp_task_wdt_init(WDT_TIMEOUT_SECONDS, true); 
  #endif
  
  esp_task_wdt_add(NULL); 

  // Auto cek pembaruan saat boot dimatikan sesuai permintaan
  // cekUpdateGitHub(); 
  // (Proses download dan restart akan dieksekusi otomatis oleh loop() jika ada update)

  // Setup Pin LED sebagai Output
  pinMode(LED_PIN, OUTPUT);
}

void loop() {
  server.handleClient(); // Jaga agar server web tetap responsif

  // Beri makan Task Watchdog Timer agar tidak reset
  esp_task_wdt_reset();

  // Jaga koneksi MQTT tetap hidup
  if (WiFi.status() == WL_CONNECTED) {
    if (!mqttClient.connected()) {
      // Coba sambung ulang setiap 5 detik tanpa memblokir sistem
      if (millis() - lastMqttReconnectAttempt > 5000) {
        lastMqttReconnectAttempt = millis();
        reconnectMQTT();
      }
    } else {
      mqttClient.loop();
    }
  }

  // Timer OTA otomatis dimatikan: update HANYA saat diklik dari Web Dashboard
  // static unsigned long lastCheck = 0;
  // if (millis() - lastCheck > UPDATE_INTERVAL_MS) { 
  //   cekUpdateGitHub();
  //   lastCheck = millis();
  // }

  // ---------------------------------------------------------
  // MASUKKAN LOGIKA RFID, KONTROL GERBANG & EMQX DI SINI
  // ---------------------------------------------------------

  // Logika Pembacaan Barcode (UART2)
  if (Serial2.available()) {
    String barcodeData = Serial2.readStringUntil('\r'); // Biasanya scanner mengirim CR atau LF di akhir
    barcodeData.trim();
    
    if (barcodeData.length() > 0) {
      Serial.println("[BARCODE] Terdeteksi! Data: " + barcodeData);
      
      if (WiFi.status() == WL_CONNECTED && mqttClient.connected()) {
        // Kirim Payload ke EMQX (Gunakan format JSON yang sama agar Backend mudah mengolahnya)
        String payload = "{\"barcode\":\"" + barcodeData + "\", \"device_id\":\"" + mqtt_client_id + "\"}";
        String pubTopic = "gate/" + mqtt_client_id + "/scan/in";
        
        if (mqttClient.publish(pubTopic.c_str(), payload.c_str())) {
          Serial.println("[MQTT] Barcode SUKSES Terkirim.");
        } else {
          Serial.println("[MQTT] Barcode GAGAL Mengirim!");
        }
      } else {
        Serial.println("[MQTT] Offline, Barcode tidak terkirim.");
      }
    }
  }

  // Logika Pembacaan RFID
  static unsigned long lastRFIDReadTime = 0;

  if (mfrc522.PICC_IsNewCardPresent() && mfrc522.PICC_ReadCardSerial()) {
    if (millis() - lastRFIDReadTime > 1000) { // Cooldown 1 detik tanpa memblokir sistem
      String rfidUid = "";
      for (byte i = 0; i < mfrc522.uid.size; i++) {
        rfidUid += String(mfrc522.uid.uidByte[i] < 0x10 ? "0" : "");
        rfidUid += String(mfrc522.uid.uidByte[i], HEX);
      }
      rfidUid.toUpperCase();
      Serial.println("[RFID] Kartu Terdeteksi! UID: " + rfidUid);

      // Cek apakah ini Kartu Master Hardcode (Bypass akses offline)
      if (rfidUid == "A166C820") {
        Serial.println("[MASTER] Kartu Master dikenali! Buka gerbang langsung tanpa MQTT.");
        openGate();
        mfrc522.PICC_HaltA();
        mfrc522.PCD_StopCrypto1();
      } else {
        // Kirim Payload ke EMQX Broker (Sesuai Requirement 1 & 2)
        String payload = "{\"rfid\":\"" + rfidUid + "\", \"device_id\":\"" + mqtt_client_id + "\"}";
        String pubTopic = "gate/" + mqtt_client_id + "/scan/in";
        
        if (mqttClient.publish(pubTopic.c_str(), payload.c_str())) {
          Serial.println("[MQTT] SUKSES Terkirim ke " + pubTopic);
        } else {
          Serial.println("[MQTT] GAGAL Mengirim! Cek koneksi atau ukuran buffer.");
        }
        
        mfrc522.PICC_HaltA();
        mfrc522.PCD_StopCrypto1();
      }

      lastRFIDReadTime = millis();
    }
  }

  // Tangani timer penutupan gerbang otomatis
  handleGate();
}